***Removing NaN values:***

In [6]:
import pandas as pd 

people_data = [{'John': 45, 'Daisy': 55}, {'John': 65, 'Daisy': 60, 'Alice': 20},{'John': 75, 'Daisy': 85},{'John': 45, 'Daisy': 55,'Alice':95},{'John': 20, 'Daisy': 35}] 

#dataframe = pd.DataFrame(people_data, index =['A','B','C','D','E'], columns =['John','Daisy']) 
 
dataframe1 = pd.DataFrame(people_data, index =['A','B','C','D','E'], columns =['John', 'Alice']) 
DropNaN=dataframe1.dropna() #Removing NaN values
#print (dataframe,  "\n") 
print (DropNaN)

   John  Alice
B    65   20.0
D    45   95.0

In [10]:
dataframe2.fillna(20)

   John  Alice
A    45   20.0
B    65   20.0
C    75   20.0
D    45   95.0
E    20   20.0